# SetCategories Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterDownloadOptions..::..SetCategories Method
ParameterDownloadOptions Class See Also
---
Set categories for binding.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public void SetCategories(
	ISet<ElementId> categories
)
```

Visual Basic
---
```text
Public Sub SetCategories ( _
	categories As ISet(Of ElementId) _
)
```

Visual C++
---
```text
public:
void SetCategories(
	ISet<ElementId^>^ categories
)
```

# ### Parameters
categories
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)>
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace